# Pandas comparison with SQL

In [2]:
import pandas as pd
import numpy as np

using the tips data set found in pandas

In [4]:
url = 'https://raw.github.com/pandas-dev/pandas/master/pandas/tests/data/tips.csv'
pd_data = pd.read_csv(url)

pd_data.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

check some metadata about your dataframe

In [5]:
pd_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
total_bill    244 non-null float64
tip           244 non-null float64
sex           244 non-null object
smoker        244 non-null object
day           244 non-null object
time          244 non-null object
size          244 non-null int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.4+ KB

check some summary statistics about your dataset

In [8]:
pd_data.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [10]:
# SELECT statement

SELECT total_bill, sex, size from tips LIMIT 10

In [12]:
pd_data[['total_bill', 'sex', 'size']].head(5)

   total_bill     sex  size
0       16.99  Female     2
1       10.34    Male     3
2       21.01    Male     3
3       23.68    Male     2
4       24.59  Female     4

In [13]:
# WHERE statement

SQL filtering is done using the WHERE statement

SELECT * from tips WHERE size > 2

In [18]:
pd_data[pd_data['size'] > 2].head(5)

   total_bill   tip     sex smoker  day    time  size
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
7       26.88  3.12    Male     No  Sun  Dinner     4

In [19]:
# in pandas it seems you have to use the square bracket notation for filtration processes

In [21]:
# Square bracket notation

In [22]:
pd_data['size'].head(5)

0    2
1    3
2    3
3    2
4    4
Name: size, dtype: int64

In [34]:
#select multiple columns from a given table where filtering

SQL  SELECT size, sex FROM tips WHERE size > 2

In [36]:
pd_data[['size','sex']] [pd_data['size']>2].head(5)

   size     sex
1     3    Male
2     3    Male
4     4  Female
5     4    Male
7     4    Male

In [37]:
# select multiple columns from a given table where filtering and another filtering

SELECT size, sex FROM tips WHERE size >2 AND sex = 'Male'

In [39]:
pd_data[['size', 'sex']][(pd_data['size']>2)&(pd_data['sex']=='Male')].head(5)

    size   sex
1      3  Male
2      3  Male
5      4  Male
7      4  Male
13     4  Male

In [42]:
# The above code passes a series of true/false booleans to the dataframe returning all the raws that are true

This is a series

In [46]:
pd_data['size'].head(7)

0    2
1    3
2    3
3    2
4    4
5    4
6    2
Name: size, dtype: int64

This is also a series

In [50]:
pd_data['size']<2

0      False
1      False
2      False
3      False
4      False
5      False
6      False
7      False
8      False
9      False
10     False
11     False
12     False
13     False
14     False
15     False
16     False
17     False
18     False
19     False
20     False
21     False
22     False
23     False
24     False
25     False
26     False
27     False
28     False
29     False
       ...
214    False
215    False
216    False
217    False
218    False
219    False
220    False
221    False
222     True
223    False
224    False
225    False
226    False
227    False
228    False
229    False
230    False
231    False
232    False
233    False
234    False
235    False
236    False
237    False
238    False
239    False
240    False
241    False
242    False
243    False
Name: size, Length: 244, dtype: bool

In [43]:
pd_data[pd_data['size']>2].head(5)

   total_bill   tip     sex smoker  day    time  size
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
7       26.88  3.12    Male     No  Sun  Dinner     4

In [54]:
pd_data[['size', 'sex','smoker']][(pd_data['size']>2)&(pd_data['sex']=='Female')&(pd_data['smoker']=='Yes')]

     size     sex smoker
102     3  Female    Yes
186     3  Female    Yes
188     3  Female    Yes
197     4  Female    Yes
205     3  Female    Yes
214     3  Female    Yes
219     4  Female    Yes

In [55]:
# SQL OR

SELECT sex, smoker FROM tips WHERE size >=2 OR sex = 'Female'

In [56]:
pd_data[['sex', 'smoker']][(pd_data['size']>=2) | (pd_data['sex']=='Female')]

        sex smoker
0    Female     No
1      Male     No
2      Male     No
3      Male     No
4    Female     No
5      Male     No
6      Male     No
7      Male     No
8      Male     No
9      Male     No
10     Male     No
11   Female     No
12     Male     No
13     Male     No
14   Female     No
15     Male     No
16   Female     No
17     Male     No
18   Female     No
19     Male     No
20     Male     No
21   Female     No
22   Female     No
23     Male     No
24     Male     No
25     Male     No
26     Male     No
27     Male     No
28     Male     No
29   Female     No
..      ...    ...
213  Female    Yes
214  Female    Yes
215  Female    Yes
216    Male    Yes
217    Male    Yes
218    Male    Yes
219  Female    Yes
220    Male    Yes
221  Female    Yes
223  Female     No
224    Male    Yes
225  Female    Yes
226  Female    Yes
227    Male     No
228    Male     No
229  Female    Yes
230    Male    Yes
231    Male    Yes
232    Male     No
233    Male     No
234    Male    Yes
235    Male     No
236    Male    Yes
237    Male    Yes
238  Female     No
239    Male     No
240  Female    Yes
241    Male    Yes
242    Male     No
243  Female     No

[243 rows x 2 columns]

In [57]:
# SQL NOT NULL & NULL

SELECT * FROM tips WHERE sex IS NULL

In [60]:
pd_data[pd_data['sex'].isna()]

Empty DataFrame
Columns: [total_bill, tip, sex, smoker, day, time, size]
Index: []

SELECT * FROM tips WHERE sex NOT NULL

In [62]:
pd_data[pd_data['sex'].notna()].head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [63]:
# GROUP BY

Group by typically refers to spliting data set into groups, apply some function typically aggregation then 
combine the groups together

SELECT sex, count(*) FROM tips GROUP BY sex

In [86]:
pd_data.groupby('sex').sum()

        total_bill     tip  size
sex
Female     1570.95  246.51   214
Male       3256.82  485.07   413

In [83]:
pd_data.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [82]:
pd_data.groupby(['sex', 'day', 'time']).sum()

                    total_bill     tip  size
sex    day  time
Female Fri  Dinner       71.55   14.05    10
            Lunch        55.76   10.98     9
       Sat  Dinner      551.05   78.45    63
       Sun  Dinner      357.70   60.61    53
       Thur Dinner       18.78    3.00     2
            Lunch       516.11   79.42    77
Male   Fri  Dinner      164.41   21.23    16
            Lunch        34.16    5.70     5
       Sat  Dinner     1227.35  181.95   156
       Sun  Dinner     1269.46  186.78   163
       Thur Lunch       561.44   89.41    73

Notice summing adds the interger values while count literally counts the frequency of the columns specified

In [87]:
pd_data.groupby('sex').count()

        total_bill  tip  smoker  day  time  size
sex
Female          87   87      87   87    87    87
Male           157  157     157  157   157   157

In [88]:
pd_data[['sex']].count()

sex    244
dtype: int64

In [92]:
pd_data[pd_data['sex']=='Female'].count()

total_bill    87
tip           87
sex           87
smoker        87
day           87
time          87
size          87
dtype: int64

In [95]:
pd_data.groupby('sex')['sex'].count()

sex
Female     87
Male      157
Name: sex, dtype: int64